package chapter03

object BitWiseOperatorDemo {
  def main(args: Array[String]): Unit = {
    val a = 5
    val b = 9
    val c = -5

    // 按位与&运算,遇到0则为0，遇到1则为1(两边同时为1)
    /**
     * 5转换为2进制： 0000 0101
     * 9转换为2进制： 0000 1001
     * ---------------------
     *           & 0000 0001
     */
    println("a & b = " + (a & b))

    // 按位或 | ， 遇到1则为1，遇到0则为0(两边同时为0)
    /**
     * 5转换为2进制： 0000 0101
     * 9转换为2进制： 0000 1001
     * ---------------------
     *           & 0000 1101
     */
    println("a | b = " + (a | b))

    // 按位异或 ^ , 1和0为1， 0和0、1和1为0
    /**
     * 5转换为2进制： 0000 0101
     * 9转换为2进制： 0000 1001
     * ---------------------
     *           & 0000 1100
     */
    println("a ^ b = " + (a ^ b))


    // 按位取反 ~ 对补码取反， 1变0， 0变1
    /**
     * -5转换为2进制： 1000 0101
     * -5的反码       1111 1010
     * -5的补码       1111 1011
     * ---------------------
     * 对补码取反  ~   0000 0100
     */
    println("~c = " + (~c))


    // 向左移动 << 移动几位右边补几个0
    /**
     * 5转换为2进制： 0000 0101
     * ---------------------
     * 向左移动2位：  0001 0100
     */
    println("a << 2 = " + (a << 2))

    // 向右移动 >> 移动几位左边补几个0
    /**
     * 5转换为2进制： 0000 0101
     * ---------------------
     * 向右移动2位：  0000 0001
     */
    println("a >> 2 = " + (a >> 2))

    // 无符号向右位移 左补0 移动几位补几个0
    println("a >>> 2 = " + (a >>> 2))




  }

}
